In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)}) 
df

  key1 key2     data1     data2
0    a  one -0.659787 -0.578511
1    a  two -0.257581 -0.916892
2    b  one  0.593533 -1.521123
3    b  two -0.732779  1.451476
4    a  one -0.890349  0.272384

In [3]:
grouped = df['data1'].groupby(df['key1'])

In [4]:
grouped

In [5]:
grouped.mean()

key1
a   -0.602572
b   -0.069623
Name: data1, dtype: float64

In [6]:
df

  key1 key2     data1     data2
0    a  one -0.659787 -0.578511
1    a  two -0.257581 -0.916892
2    b  one  0.593533 -1.521123
3    b  two -0.732779  1.451476
4    a  one -0.890349  0.272384

In [7]:
means = df['data1'].groupby( [ df['key1'], df['key2']] ).mean()

In [8]:
means

key1  key2
a     one    -0.775068
      two    -0.257581
b     one     0.593533
      two    -0.732779
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.775068 -0.257581
b     0.593533 -0.732779

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.602572 -0.407673
b    -0.069623 -0.034823

In [11]:
df.groupby(['key1','key2']).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [12]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.775068 -0.153064
     two  -0.257581 -0.916892
b    one   0.593533 -1.521123
     two  -0.732779  1.451476

In [14]:
#df.groupby?

In [19]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']) 
df2

               a         b         c         d         e
Joe     0.811616  1.171092  0.529039 -1.462022 -0.562042
Steve  -0.450952  0.506779  0.043009 -1.267822 -2.331370
Wes     0.760299  0.643764 -0.137070 -0.235327 -0.265445
Jim     0.612851  0.138216 -0.017765 -1.762913  0.014493
Travis  0.945837 -1.785689  0.491393 -0.814284  0.521406

In [20]:
map_dict = {'a':'red', 'b':'red', 'c':'blue', 'd':'red', 'e':'blue', 'f':'gold'}

In [21]:
type(map_dict)

dict

In [22]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe    -0.033003  0.520687
Steve  -2.288361 -1.211995
Wes    -0.402515  1.168736
Jim    -0.003272 -1.011846
Travis  1.012799 -1.654137

In [23]:
df

  key1 key2     data1     data2
0    a  one -0.659787 -0.578511
1    a  two -0.257581 -0.916892
2    b  one  0.593533 -1.521123
3    b  two -0.732779  1.451476
4    a  one -0.890349  0.272384

In [24]:
grouped = df.groupby('key1')

In [25]:
grouped

In [26]:
def peak(arr):
    return arr.max() - arr.min()

In [27]:
grouped.agg(peak)

         data1     data2
key1
a     0.632768  1.189275
b     1.326312  2.972599

In [28]:
grouped.agg('std')

         data1     data2
key1
a     0.320241  0.612767
b     0.937845  2.101945

In [29]:
grouped.std()

         data1     data2
key1
a     0.320241  0.612767
b     0.937845  2.101945